flatPlate_TEact_noflow/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    down
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          610;
        startFace       553664;
    }
    right
    {
        type            patch;
        nFaces          496;
        startFace       554274;
    }
    up
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          610;
        startFace       554770;
    }
    left
    {
        type            patch;
        nFaces          496;
        startFace       555380;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          680;
        startFace       555876;
    }
    slot
    {
        type            patch;
        nFaces          20;
        startFace       556556;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          555120;
        startFace       556576;
    }
)

// ************************************************************************* //
